In [1]:
import pandas as pd

In [2]:
dss = pd.read_csv("Data_Sciecne_Survey.csv")

In [3]:
dss.head()

,experience_coding,python_user,r_user,sql_user,most_used,compensation
0,6.1,True,False,True,Scikit-learn,124267
1,12.3,True,True,True,Scikit-learn,236889
2,2.2,True,False,False,None,74321
3,2.7,False,False,True,None,62593
4,1.2,True,False,False,Scikit-learn,36288

In [4]:
dss.describe()

       experience_coding  compensation
count       25973.000000  2.597300e+04
mean            5.297232  5.325282e+04
std             6.898151  8.008224e+04
min             0.000000  0.000000e+00
25%             0.950000  7.702000e+03
50%             2.500000  5.401000e+04
75%             6.000000  6.748000e+04
max            30.000000  1.492951e+06

In [5]:
dss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25973 entries, 0 to 25972
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   experience_coding  25973 non-null  float64
 1   python_user        25973 non-null  bool
 2   r_user             25973 non-null  bool
 3   sql_user           25973 non-null  bool
 4   most_used          25973 non-null  object
 5   compensation       25973 non-null  int64
dtypes: bool(3), float64(1), int64(1), object(1)
memory usage: 685.0+ KB

In [6]:
def catego_exp(experience_coding):
    if experience_coding < 5:
        return "Less then 5 years"
    elif experience_coding in range(5,11):
        return "5-10 years"
    elif experience_coding in range(11,16):
        return "10-15 years"
    elif experience_coding in range(16,21):
        return "15-20 years"
    elif experience_coding in range(21,26):
        return "20-25 years"
    else:
        return "25+ years"

In [7]:
dss["experience_coding"].apply(catego_exp)

0                25+ years
1                25+ years
2        Less then 5 years
3        Less then 5 years
4        Less then 5 years
               ...
25968    Less then 5 years
25969    Less then 5 years
25970    Less then 5 years
25971            25+ years
25972    Less then 5 years
Name: experience_coding, Length: 25973, dtype: object

In [8]:
dss["experience_coding_catego"] = dss["experience_coding"].apply(catego_exp)

In [9]:
dss.head()

,experience_coding,python_user,r_user,sql_user,most_used,compensation,experience_coding_catego
0,6.1,True,False,True,Scikit-learn,124267,25+ years
1,12.3,True,True,True,Scikit-learn,236889,25+ years
2,2.2,True,False,False,None,74321,Less then 5 years
3,2.7,False,False,True,None,62593,Less then 5 years
4,1.2,True,False,False,Scikit-learn,36288,Less then 5 years

In [12]:
dss.groupby("experience_coding_catego")["compensation"].mean().round(2)

experience_coding_catego
10-15 years           65231.50
15-20 years           82758.38
20-25 years          125575.79
25+ years             74884.86
5-10 years            56392.02
Less then 5 years     45047.87
Name: compensation, dtype: float64